Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.88/include/pio/pic32cm1216le00100.h
#define PIN_PA15D_SERCOM0_PAD3                     _UL_(15)    
#define MUX_PA15D_SERCOM0_PAD3                     _UL_(3)     
#define PINMUX_PA15D_SERCOM0_PAD3                  ((PIN_PA15D_SERCOM0_PAD3 << 16) | MUX_PA15D_SERCOM0_PAD3)
#define PORT_PA15D_SERCOM0_PAD3                    (_UL_(1) << 15)

#define PIN_PA19D_SERCOM0_PAD3                     _UL_(19)    
#define MUX_PA19D_SERCOM0_PAD3                     _UL_(3)     
#define PINMUX_PA19D_SERCOM0_PAD3                  ((PIN_PA19D_SERCOM0_PAD3 << 16) | MUX_PA19D_SERCOM0_PAD3)
#define PORT_PA19D_SERCOM0_PAD3                    (_UL_(1) << 19)

#define PIN_PA25C_SERCOM0_PAD3                     _UL_(25)    
#define MUX_PA25C_SERCOM0_PAD3                     _UL_(2)     
#define PINMUX_PA25C_SERCOM0_PAD3                  ((PIN_PA25C_SERCOM0_PAD3 << 16) | MUX_PA25C_SERCOM0_PAD3)
#define PORT_PA25C_SERCOM0_PAD3                    (_UL_(1) << 25)

#define PIN_PB23C_SERCOM0_PAD3                     _UL_(55)    
#define MUX_PB23C_SERCOM0_PAD3                     _UL_(2)     
#define PINMUX_PB23C_SERCOM0_PAD3                  ((PIN_PB23C_SERCOM0_PAD3 << 16) | MUX_PB23C_SERCOM0_PAD3)
#define PORT_PB23C_SERCOM0_PAD3                    (_UL_(1) << 23)

#define PIN_PC25C_SERCOM0_PAD3                     _UL_(89)    
#define MUX_PC25C_SERCOM0_PAD3                     _UL_(2)     
#define PINMUX_PC25C_SERCOM0_PAD3                  ((PIN_PC25C_SERCOM0_PAD3 << 16) | MUX_PC25C_SERCOM0_PAD3)
#define PORT_PC25C_SERCOM0_PAD3                    (_UL_(1) << 25)

#define PIN_PA03D_SERCOM0_PAD3                     _UL_(3)     
#define MUX_PA03D_SERCOM0_PAD3                     _UL_(3)     
#define PINMUX_PA03D_SERCOM0_PAD3                  ((PIN_PA03D_SERCOM0_PAD3 << 16) | MUX_PA03D_SERCOM0_PAD3)
#define PORT_PA03D_SERCOM0_PAD3                    (_UL_(1) << 3)

/* ========== PORT definition for SERCOM1 peripheral ========== */
#define PIN_PC27D_SERCOM1_PAD0                     _UL_(91)    
#define MUX_PC27D_SERCOM1_PAD0                     _UL_(3)     
#define PINMUX_PC27D_SERCOM1_PAD0                  ((PIN_PC27D_SERCOM1_PAD0 << 16) | MUX_PC27D_SERCOM1_PAD0)
#define PORT_PC27D_SERCOM1_PAD0                    (_UL_(1) << 27)

#define PIN_PA16C_SERCOM1_PAD0                     _UL_(16)    
#define MUX_PA16C_SERCOM1_PAD0                     _UL_(2)     
#define PINMUX_PA16C_SERCOM1_PAD0                  ((PIN_PA16C_SERCOM1_PAD0 << 16) | MUX_PA16C_SERCOM1_PAD0)
#define PORT_PA16C_SERCOM1_PAD0                    (_UL_(1) << 16)

#define PIN_PB30C_SERCOM1_PAD0                     _UL_(62)    
#define MUX_PB30C_SERCOM1_PAD0                     _UL_(2)     
#define PINMUX_PB30C_SERCOM1_PAD0                  ((PIN_PB30C_SERCOM1_PAD0 << 16) | MUX_PB30C_SERCOM1_PAD0)
#define PORT_PB30C_SERCOM1_PAD0                    (_UL_(1) << 30)

#define PIN_PC12C_SERCOM1_PAD0                     _UL_(76)    
#define MUX_PC12C_SERCOM1_PAD0                     _UL_(2)     
#define PINMUX_PC12C_SERCOM1_PAD0                  ((PIN_PC12C_SERCOM1_PAD0 << 16) | MUX_PC12C_SERCOM1_PAD0)
#define PORT_PC12C_SERCOM1_PAD0                    (_UL_(1) << 12)

#define PIN_PA08C_SERCOM1_PAD0                     _UL_(8)     
#define MUX_PA08C_SERCOM1_PAD0                     _UL_(2)     
#define PINMUX_PA08C_SERCOM1_PAD0                  ((PIN_PA08C_SERCOM1_PAD0 << 16) | MUX_PA08C_SERCOM1_PAD0)
#define PORT_PA08C_SERCOM1_PAD0                    (_UL_(1) << 8)

#define PIN_PA00D_SERCOM1_PAD0                     _UL_(0)     
#define MUX_PA00D_SERCOM1_PAD0                     _UL_(3)     
#define PINMUX_PA00D_SERCOM1_PAD0                  ((PIN_PA00D_SERCOM1_PAD0 << 16) | MUX_PA00D_SERCOM1_PAD0)
#define PORT_PA00D_SERCOM1_PAD0                    (_UL_(1) << 0)

#define PIN_PC28D_SERCOM1_PAD1                     _UL_(92)    
#define MUX_PC28D_SERCOM1_PAD1                     _UL_(3)     
#define PINMUX_PC28D_SERCOM1_PAD1                  ((PIN_PC28D_SERCOM1_PAD1 << 16) | MUX_PC28D_SERCOM1_PAD1)
#define PORT_PC28D_SERCOM1_PAD1                    (_UL_(1) << 28)

#define PIN_PA17C_SERCOM1_PAD1                     _UL_(17)    
#define MUX_PA17C_SERCOM1_PAD1                     _UL_(2)     
#define PINMUX_PA17C_SERCOM1_PAD1                  ((PIN_PA17C_SERCOM1_PAD1 << 16) | MUX_PA17C_SERCOM1_PAD1)
#define PORT_PA17C_SERCOM1_PAD1                    (_UL_(1) << 17)

#define PIN_PB31C_SERCOM1_PAD1                     _UL_(63)    
#define MUX_PB31C_SERCOM1_PAD1                     _UL_(2)     
#define PINMUX_PB31C_SERCOM1_PAD1                  ((PIN_PB31C_SERCOM1_PAD1 << 16) | MUX_PB31C_SERCOM1_PAD1)
#define PORT_PB31C_SERCOM1_PAD1                    (_UL_(1) << 31)

#define PIN_PC13C_SERCOM1_PAD1                     _UL_(77)    
#define MUX_PC13C_SERCOM1_PAD1                     _UL_(2)     
#define PINMUX_PC13C_SERCOM1_PAD1                  ((PIN_PC13C_SERCOM1_PAD1 << 16) | MUX_PC13C_SERCOM1_PAD1)
#define PORT_PC13C_SERCOM1_PAD1                    (_UL_(1) << 13)

#define PIN_PA09C_SERCOM1_PAD1                     _UL_(9)     
#define MUX_PA09C_SERCOM1_PAD1                     _UL_(2)     
#define PINMUX_PA09C_SERCOM1_PAD1                  ((PIN_PA09C_SERCOM1_PAD1 << 16) | MUX_PA09C_SERCOM1_PAD1)
#define PORT_PA09C_SERCOM1_PAD1                    (_UL_(1) << 9)

#define PIN_PA01D_SERCOM1_PAD1                     _UL_(1)     
#define MUX_PA01D_SERCOM1_PAD1                     _UL_(3)     
#define PINMUX_PA01D_SERCOM1_PAD1                  ((PIN_PA01D_SERCOM1_PAD1 << 16) | MUX_PA01D_SERCOM1_PAD1)
#define PORT_PA01D_SERCOM1_PAD1                    (_UL_(1) << 1)

#define PIN_PA18C_SERCOM1_PAD2                     _UL_(18)    
#define MUX_PA18C_SERCOM1_PAD2                     _UL_(2)     
#define PINMUX_PA18C_SERCOM1_PAD2                  ((PIN_PA18C_SERCOM1_PAD2 << 16) | MUX_PA18C_SERCOM1_PAD2)
#define PORT_PA18C_SERCOM1_PAD2                    (_UL_(1) << 18)

#define PIN_PC10C_SERCOM1_PAD2                     _UL_(74)    
#define MUX_PC10C_SERCOM1_PAD2                     _UL_(2)     
#define PINMUX_PC10C_SERCOM1_PAD2                  ((PIN_PC10C_SERCOM1_PAD2 << 16) | MUX_PC10C_SERCOM1_PAD2)
#define PORT_PC10C_SERCOM1_PAD2                    (_UL_(1) << 10)

#define PIN_PA10C_SERCOM1_PAD2                     _UL_(10)    
#define MUX_PA10C_SERCOM1_PAD2                     _UL_(2)     
#define PINMUX_PA10C_SERCOM1_PAD2                  ((PIN_PA10C_SERCOM1_PAD2 << 16) | MUX_PA10C_SERCOM1_PAD2)
#define PORT_PA10C_SERCOM1_PAD2                    (_UL_(1) << 10)

